import {InitOptions} from "i18next";

export const I18InitProps: InitOptions = {
    resources: {
        ru: {
            translation: {
                "upcoming": "ожидаемые",
                "popular": "популярные",
                "now playing": "смотрят",
                "top rated": "лучшие",
                "discover": "поиск",
                "register": "зарегистрироваться",
                "login": "войти",
                "logout": "выйти",
                "clear store": "очистить",
                "genres": "жанры",
                "prev": "назад",
                "next": "след",
                "more": "еще",
                "clean": "очистить",
                "success": "успех",
                "choices": "показать отобранные",
                "clean choices": "скрыть отобранные",
                "original_title.asc": "👆 оригинальное название",
                "original_title.desc": "⬇️ оригинальное название",
                "popularity.asc": "👆 популярность",
                "popularity.desc": "⬇️ популярность",
                "revenue.asc": "👆 поступления",
                "revenue.desc": "⬇️ поступления",
                "primary_release_date.asc": "👆 дата релиза",
                "primary_release_date.desc": "⬇️ дата релиза",
                "title.asc": "👆 название",
                "title.desc": "⬇️ название",
                "vote_average.asc": "👆 рейтинг",
                "vote_average.desc": "⬇️ рейтинг",
                "vote_count.asc": "👆 количество голосов",
                "vote_count.desc": "⬇️ количество голосов"
            }
        },
        uk: {
            translation: {
                "upcoming": "незабаром",
                "popular": "популярні",
                "now playing": "дивляться",
                "top rated": "найкращі",
                "discover": "пошук",
                "register": "реєстрація",
                "login": "увійти",
                "logout": "вийти",
                "clear store": "очистити",
                "genres": "жанри",
                "prev": "назад",
                "next": "вперед",
                "more": "далі",
                "clean": "очистити",
                "success": "успіх",
                "choices": "показати відібрані",
                "clean choices": "сховати відібрані",
                "original_title.asc": "👆 оригінальна назва",
                "original_title.desc": "⬇️ оригінальна назва",
                "popularity.asc": "👆 популярність",
                "popularity.desc": "⬇️ популярність",
                "revenue.asc": "👆 надходження",
                "revenue.desc": "⬇️ надходження",
                "primary_release_date.asc": "👆 дата релізу",
                "primary_release_date.desc": "⬇️ дата релізу",
                "title.asc": "👆 назва",
                "title.desc": "⬇️ назва",
                "vote_average.asc": "👆 рейтинг",
                "vote_average.desc": "⬇️ рейтинг",
                "vote_count.asc": "👆 кількість голосів",
                "vote_count.desc": "⬇️ кількість голосів"
            }
        }
    },
    fallbackLng: "en",
    interpolation: {
        escapeValue: false
    }
};